// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================
class Purchase {}

// // ================================================================
// router.get Створює нам один ентпоїнт

// // ↙️ тут вводимо шлях (PATH) до сторінки
// router.get('/', function (req, res) {
//   // res.render генерує нам HTML сторінку

//   // ↙️ cюди вводимо назву файлу з сontainer
//   res.render('alert', {
//     // вказуємо назву папки контейнера, в якій знаходяться наші стилі
//     style: 'alert',

//     data: {
//       message: 'Операція успішна',
//       info: 'Товар створенний',
//       link: '/test-path',
//     },
//   })
//   // ↑↑ сюди вводимо JSON дані
// })
// // ================================================================

// router.get Створює нам один ентпоїнт
// // ↙️ тут вводимо шлях (PATH) до сторінки
router.get('/', function (reg, res) {
  // res.render генерує нам HTML сторінку

  //↙️ cюди вводимо назву файлу з сontainer
  res.render('purchase-index', {
    // вказуємо назву папки контейнера, в якій знаходяться наші стилі
    style: 'purchase-index',

    data: {
      img: 'https://picsum.photos/200/300',
      title:
        "Koмп'ютер Artline Gaming (X43v31) AMD Ryzen 5 3600/",
      description:
        'AMD Ryzen 5 3600 (3.6 - 4.2 ) / RAM 16 5 / HDD 1 T5 + SSD 488 ГБ /',
      category: [
        { id: 1, text: 'Готовий до відправки' },
        { id: 2, text: 'Ton продажів' },
      ],
      price: 27080,
    },
  })
  // ↑↑ сюди вводимо JSON дані
})

// // ================================================================

// Підключаємо роутер до бек-енду
module.exports = router
